/**
 ******************************************************************************
 * @file    park_back.c
 * @brief   基础任务二：倒车入库 + 侧方停车
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "park_back.h"

#include "calib.h"
#include "ir_sensor.h"
#include "line_follow.h"
#include "motor.h"
#include "turn.h"

void 倒库(void)
{
    HAL_Delay(2000);
    巡线(40);
    右转();
    巡线(40);
    电机_设置双轮(0, 10);
    HAL_Delay(120);
    电机_全部停止();
    HAL_Delay(200);
    巡线(10);
    校准();
    HAL_Delay(500);
    电机_设置双轮(-20, -20);
    HAL_Delay(120);
    电机_全部停止();
}

void 侧方停车(void)
{
    HAL_Delay(2000);
    巡线(40);
    右转();
    巡线(40);
    右转();
    巡线(40);
    右转();
    巡线(40);
    电机_设置双轮(10, 10);
    HAL_Delay(120);
    电机_全部停止();
    HAL_Delay(200);

    校准();
    HAL_Delay(500);

    电机_设置双轮(20, 20);
    HAL_Delay(120);
    电机_全部停止();
    电机_设置双轮(10, -10);
    HAL_Delay(700);
    电机_全部停止();
}